{
  "A": {
    "description": "For the letter A, close your fist with the thumb on the side of the index finger."
  },
  "B": {
    "description": "For the letter B, extend your fingers upwards with the thumb crossed in front of your palm."
  },
  "C": {
    "description": "For the letter C, curve your fingers and thumb to form the shape of the letter C."
  },
  "D": {
    "description": "For the letter D, hold up your index finger while the other fingers touch the thumb."
  },
  "E": {
    "description": "For the letter E, curl your fingers into your palm with the thumb resting on the tips."
  },
  "F": {
    "description": "For the letter F, touch your thumb and index finger together, forming a circle, with the other fingers extended."
  },
  "G": {
    "description": "For the letter G, hold your index finger and thumb parallel, pointing to the side."
  },
  "H": {
    "description": "For the letter H, extend your index and middle finger horizontally, with the thumb supporting the others."
  },
  "I": {
    "description": "For the letter I, hold your pinky finger straight up with the other fingers curled into the palm."
  },
  "J": {
    "description": "For the letter J, start with the I hand shape, then move your pinky finger in a J-shaped motion."
  },
  "K": {
    "description": "For the letter K, extend your index and middle finger while the thumb supports the middle finger."
  },
  "L": {
    "description": "For the letter L, extend your thumb and index finger to form an L shape."
  },
  "M": {
    "description": "For the letter M, place your thumb between your pinky and ring fingers while the other fingers fold over."
  },
  "N": {
    "description": "For the letter N, place your thumb between your ring and middle fingers while the other fingers fold over."
  },
  "O": {
    "description": "For the letter O, form an O shape by bringing your fingers and thumb together in a circular shape."
  },
  "P": {
    "description": "For the letter P, form the K sign but point it downward."
  },
  "Q": {
    "description": "For the letter Q, form the G sign but point it downward."
  },
  "R": {
    "description": "For the letter R, cross your index and middle fingers while keeping the others folded."
  },
  "S": {
    "description": "For the letter S, make a fist with your thumb across the front of your fingers."
  },
  "T": {
    "description": "For the letter T, place your thumb between your index and middle fingers, creating a fist."
  },
  "U": {
    "description": "For the letter U, extend your index and middle fingers upward together, keeping them close."
  },
  "V": {
    "description": "For the letter V, extend your index and middle fingers apart to form a V shape."
  },
  "W": {
    "description": "For the letter W, extend your index, middle, and ring fingers while the thumb and pinky stay folded."
  },
  "X": {
    "description": "For the letter X, curl your index finger to resemble a hook, with the other fingers folded."
  },
  "Y": {
    "description": "For the letter Y, extend your thumb and pinky finger while keeping the other fingers folded."
  },
  "Z": {
    "description": "For the letter Z, trace the shape of a Z in the air using your index finger."
  }
}
